\chapter{Технологическая часть}
В данном разделе будут приведены требования к программному обеспечению, средства реализации и листинги кода.

\section{Требования к программе}

К программе предъявляется ряд требований:
\begin{itemize}
	\item на вход подаётся строка, на основании которой производится поиск;
	\item на выходе --- результат поиска в словаре;
	\item программа не должна аварийно завершаться при отсутствии ключа в словаре.
\end{itemize}

\section{Средства реализации}

В качестве языка программирования для реализации данной лабораторной работы был выбран ЯП Python \cite{pythonlang}. 

Данный язык достаточно удобен и гибок в использовании. 

В качестве среды разработки выбор сделан в сторону Visual Studio Code \cite{wind}. Данная среда подходит как для Windows, так для Linux. и macOS

\section{Сведения о модулях программы}
Данная программа разбита на модули:
\begin{itemize}
	\item main.py -- файл, содержащий меню программы и основную функцию;
	\item info\_for\_prog.py -- файл, содержащий класс, который описывает информацию о данных;
	\item dictionary.py -- файл, содержащий класс ''Словарь''.
\end{itemize}

\section{Реализация алгоритмов}
В листинге \ref{lst:bfs} представлена реализация алгоритма поиска в словаре полным перебором.

\begin{center}
	\captionsetup{justification=raggedright,singlelinecheck=off}
	
	\begin{lstlisting}[label=lst:bfs,caption=Реализация алгоритма поиска полным перебором]
		def Search(self, key):
			k = 0
			keys = list(self.data.keys())
			for elem in self.data:
				k += 1
				if key == elem:
					// Log
					self.f.write(f"{keys.index(key)},{key},{k}\n") 
					return self.data[elem]
			return -1
	\end{lstlisting}
\end{center}

\section{Функциональное тестирование}

В данном разделе будет приведена таблица с тестами (таблица \ref{table:ref1}).
\begin{center}
	\captionsetup{justification=raggedright,singlelinecheck=off}
	\begin{table}[ht]
		\centering
		\caption{Таблица тестов}
		\label{table:ref1}
		\begin{tabular}{ |c|c|c|}
			\hline
			Входные данные     & Результат    \\ \hline
			\hline
			длинная река	& Нил \\ \hline
			короткая река 	& Москва \\ \hline
			средняя река & Енисей \\ \hline
			компот & Элемент не существует (-1) \\ \hline
			8273 &  Элемент не существует (-1) \\ \hline
		\end{tabular}
	\end{table}
\end{center}
Все тесты пройдены успешно.


\section*{Вывод}
В данном разделе был представлен листинг рассматриваемого алгоритма поиска в словаре, приведена информация о средствах реализации, сведения о модулях программы и было проведено функциональное тестирование.